Revit 2027 API
BeamSystem.GetBeamIds Method
Gets all the beams of the BeamSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetBeamIds()
Public Function GetBeamIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetBeamIds()
member GetBeamIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The beam Ids.
See Also
Reference
BeamSystem Class
Autodesk.Revit.DB Namespace